In [2]:
#from shapely.geometry import Point
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster

In [3]:
from sqlalchemy import create_engine, text

In [17]:
database_name = 'scooters'    
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [18]:
engine = create_engine(connection_string)

In [55]:
##Are there any null values in any columns in either table?
query = '''
SELECT *
FROM scooters
WHERE chargelevel IS NULL ;
'''



with engine.connect() as connection:
    scooters_null = pd.read_sql(text(query), con = connection)
scooters_null.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 770 entries, 0 to 769
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  770 non-null    datetime64[ns]
 1   latitude     770 non-null    float64
 2   longitude    770 non-null    float64
 3   sumdid       770 non-null    object
 4   sumdtype     770 non-null    object
 5   chargelevel  0 non-null      object
 6   sumdgroup    770 non-null    object
 7   costpermin   770 non-null    float64
 8   companyname  770 non-null    object
dtypes: datetime64[ns](1), float64(3), object(5)
memory usage: 54.3+ KB

In [56]:
scooters_null

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-24 12:41:05.117,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin
1,2019-05-24 14:26:09.590,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin
2,2019-05-24 14:31:09.533,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin
3,2019-05-24 14:36:09.760,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin
4,2019-05-24 14:41:09.940,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin
...,...,...,...,...,...,...,...,...,...
765,2019-07-28 05:02:38.000,36.158123,-86.789372,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
766,2019-07-28 05:07:38.000,36.158093,-86.789338,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
767,2019-07-28 05:12:38.000,36.158297,-86.789378,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
768,2019-07-29 00:48:07.000,36.149802,-86.807646,Powered-55a7ac02-7e17-bb3b-130d-b160d9776405,Powered,None,Scooter,0.30,Bolt
769,2019-07-29 00:53:07.000,36.149802,-86.807646,Powered-55a7ac02-7e17-bb3b-130d-b160d9776405,Powered,None,Scooter,0.30,Bolt

In [43]:
##What date range is represented in each of the date columns? Investigate any values that seem odd.
query = '''
SELECT pubdatetime
FROM scooters
LIMIT 100;
'''



with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)

scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 928.0 bytes

## 1.During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [57]:
Sql_count_scooter = '''
SELECT DISTINCT companyname, COUNT(sumdid)
FROM scooters
GROUP BY companyname;
'''



with engine.connect() as connection:
    company_count = pd.read_sql(text(Sql_count_scooter), con = connection)
company_count

  companyname     count
0        Bird  12251590
1        Bolt   3477198
2      Gotcha   4679280
3        Jump  21835098
4        Lime  16524261
5        Lyft   9087043
6        Spin   5559573

## Did the number for each company change over time?

In [ ]:
SELECT pubdatetime, companyname, COUNT(sumdid)
FROM scooters
GROUP BY pubdatetime, companyname
ORDER BY COUNT(sumdid) desc

Trying to see how to get a count for each month

In [59]:
change_over = '''
SELECT pubdatetime::date AS date, companyname, COUNT(*) as count
FROM scooters
GROUP BY date, companyname
ORDER BY date, companyname;
'''



with engine.connect() as connection:
    over_time = pd.read_sql(text(change_over), con = connection)
over_time

           date companyname   count
0    2019-05-01        Bird  155563
1    2019-05-01      Gotcha   42287
2    2019-05-01        Lime  257945
3    2019-05-01        Lyft  113276
4    2019-05-02        Bird  150005
..          ...         ...     ...
573  2019-07-31      Gotcha   63936
574  2019-07-31        Jump  341476
575  2019-07-31        Lime  115543
576  2019-07-31        Lyft  113321
577  2019-07-31        Spin   43084

[578 rows x 3 columns]